
* TODO Code Revisions
** DONE Changing Variables 
   To minimise ambiguity and to Structure variables to allow structures to be passed rather than variables.    
   -- Week 27 (July 2-6) and Week 29 (July 16-20)
*** DONE final.m
*** DONE calculatestress.m --- not used
*** DONE ellipse2011.m


** DONE temporary and permanent structures for disp and cohesive
** DONE Write steploads quantities to loads quantities at end of timestep. 
  Also, use loads quantities from previous timestep as first guess for steploads quantities? 
  --- No, don't need to guess steploads quantities.
** DONE subroutine to copy final timestep version back into load
** DONE 4/7/12: Need very strict rules about updating - 
can't update anything inside residual.m
** DONE Develop good rules for all variables which must be updated, when it happens, how it happens.  
   CLOCK: [2012-07-19 Thu 10:37]--[2012-07-19 Thu 12:20] =>  1:43

** DONE Sometimes I need to output phi, phiprime, psi
   CLOCK: [2012-07-20 Fri 10:28]--[2012-07-20 Fri 10:51] =>  0:23
** DONE Should SigmaBar1 be an input or should it just always be 1?  
   CLOCK: [2012-07-20 Fri 10:56]--[2012-07-20 Fri 11:03] =>  0:07
  We don't control the magnitude of loading but only the shape, so this should not be a variable
** DONE lambda and lambda_max need to be tracked throughout 
   CLOCK: [2012-07-20 Fri 11:10]--[2012-07-20 Fri 11:46] =>  0:36
** DONE Should cohesive loading/unloading decision be made on the fly or at the end of previous converged step?
   --- I think, from past experience, it's safer to use the end of previous converged step - we get convergence issues otherwise with switching back and forth




    
* TODO Run code in Matlab and in Octave 
  -- Week 30 (July 23-27)
   

** TODO There will be a problem for the case when e_11 turns out to be zero or close to zero - include warning
** TODO problem with loading angles (I don't accept omega=pi/2) see p.67
** TODO How do I want to handle damage under normal compression?  
   -- At the moment I accumulate damage, but compensate for slope in normal mode.  
      But large normal compression and no shear could still result in substantial damage - this is wrong
** TODO Check eq 4.80 - have we accounted for plane stress/plane strain?
       --- I calculate kappa for plane stress and plane strain, and in fact have a parameter for plane stress or plane strain in the input file, but eq 4.80 in the derivation is only for plane strain.  
       --- Remove option or do alternative derivation?



* TODO Write standard tests 
   -- Weeks 31 and 32 (July 30-August 10)
** TODO timoshenko files or test files
** TODO Test principal.m and unprincipal.m functions - 
    especially calculation of alpha in principal.m
    Also check that the sign of alpha is handled correctly when calculating alpha_1 and alpha_2 
    - see p.9 of Denel notebook
** TODO Check that A_1 and A_2 are calculated correctly
** TODO Run checks on macrostress subroutine - many many typos may introduce errors.



* TODO Debugging 
   -- Weeks 33-34 (August 13-August 24)
* TODO Run Results and compare with previous findings for validity 
   -- Week 35 (August 27-31)

* TODO Implement Optimisation Algorithms for Non-linear solver problem
** TODO Optimisation Technique that doesn't rely on gradients 
   -- Weeks 36-38 (September 3-21)
** TODO Validate against Jay's code 
   -- Weeks 39-40 (September 24-October 5)
   
* TODO Get Results against test cases 
  -- Weeks 41 (October 8-12)

* TODO Write results into Dissertation (including conclusions) 
  -- Weeks 42-43 (October 15-26)
  
* TODO Distribute to the committee for approval 
-- Weeks 44-45 (October 29-November9) 

* TODO Submit 
-- (Due November 16)





* Documentation
** TODO Write iteration algorithm carefully for thesis
   Maps for when variables are accessed and changed. e.g. steploads quantities, disp quantities.
** TODO Document derivation of angles
** TODO Note on p.50
** TODO Add unloading path to definition of cohesive law p65
** TODO Fix integration bounds, absolute value p68
** TODO include equation for stress transformation, fix sign error p69





* Questions to be answered
** TODO Do I ever actually need to calculate the stress?  Why am I not calculating stress?
       ---Removed from subroutine farfieldstress 16/7/2012 but still need to check reasoning
** TODO Timestep shouldn't be needed in stack or unstack Carl has ideas 
   load should be an array of structures rather than a structure containing arrays
** TODO check that I can pass structures with name changes as I do from residual to stack and unstack
** TODO Am I causing problems by storing phi, phiprime, psi instead of using and discarding them?  
       --- Do I have storage/speed issues?
       --- Perhaps I could only save them in final.m - that would mean sacrificing common.m? or setting an option?
       --- If I am saving them at each timestep it might be possible to loop more efficiently?
** TODO Get Carl to help me write a better input reader/input deck (i.e. more robust)
** TODO Can I have a structure of structures? i.e. step.disp.etc and final.disp.etc? or steppot.coh.phi, steppot.ff.phi?
** TODO Do I want stepsoln?



* Completed
** DONE Check definition of beta
** DONE Can't cope with zero stress in 11 direction at the moment.
        --- Derivation in Denel notebook pp 11-12, implemented in initialize_loading.m and macrostress.m 18/7/2012
** DONE Calculate phiprime2 and psiprime only when necessary - two phi functions? 
** DONE 3/7/12: Correct calculation of cohesive law - I think this needs to be rationalised and reworked.  
   Is there any reason to have separate subroutines?  
** DONE Why are we not keeping track of the previous value of lambda?  No attempt to handle unloading. 
        --- derivation 4/7/2012,
        --- implemented 4/7/2012, still need to watch for updating global values
** DONE put disp, t_coh etc into structures
  CLOCK: [2012-07-17 Tue 10:38]--[2012-07-17 Tue 11:03] =>  0:25
** DONE 5/7/12: put input file name as parameter in read_input.m
   done immediately by Carl
** DONE get code into Github
  CLOCK: [2012-07-05 Thu 10:49]--[2012-07-05 Thu 12:12] =>  1:23
** DONE subroutine to copy current timestep versions of load
** DONE common features of residual.m and final.m in a new subroutine
** DONE Macrostress needs to be more flexible so it can be called from final as well as residual
** DONE use stack and unstack in residual.m  
  CLOCK: [2012-07-17 Tue 11:03]--[2012-07-17 Tue 11:19] =>  0:16
